Revit 2027 API
RevolvedSurface.GetProfileCurve Method
 Returns a copy of the profile curve expressed in the surface's coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve GetProfileCurve()
Public Function GetProfileCurve As Curve
public:
Curve^ GetProfileCurve()
member GetProfileCurve : unit -> Curve
Return Value
Curve
 A copy of the profile curve.
See Also
Reference
RevolvedSurface Class
Autodesk.Revit.DB Namespace